LukiBa/RS485-IO-Extension/SW/IOgateway/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void)
{
    /* Write to GPIO1: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GateGPIO1);
    /* Write to GPIO2: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GateGPIO2);
    /* Write to GPIO3: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GateGPIO3);
    /* Write to PORT0: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GatePORT0);
    /* Write to PORT1: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GatePORT1);
    /* Write to PORT2: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GatePORT2);
    /* Write to PORT3: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GatePORT3);
    /* GPIO1 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kGPIO1_RST_SHIFT_RSTn);
    /* GPIO2 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kGPIO2_RST_SHIFT_RSTn);
    /* GPIO3 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kGPIO3_RST_SHIFT_RSTn);
    /* LPUART0 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kLPUART0_RST_SHIFT_RSTn);
    /* PORT0 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kPORT0_RST_SHIFT_RSTn);
    /* PORT1 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kPORT1_RST_SHIFT_RSTn);
    /* LPUART2 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kLPUART2_RST_SHIFT_RSTn);
    /* ADC0 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kADC0_RST_SHIFT_RSTn);
    /* PORT2 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kPORT2_RST_SHIFT_RSTn);
    /* LPUART1 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kLPUART1_RST_SHIFT_RSTn);
    /* PORT3 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kPORT3_RST_SHIFT_RSTn);
    /* FLEXPWM0 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kFLEXPWM0_RST_SHIFT_RSTn);

    gpio_pin_config_t RS485_DE_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_6 (pin 64)  */
    GPIO_PinInit(BOARD_INITPINS_RS485_DE_GPIO, BOARD_INITPINS_RS485_DE_PIN, &RS485_DE_config);

    gpio_pin_config_t RS485_nRE_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_7 (pin 1)  */
    GPIO_PinInit(BOARD_INITPINS_RS485_nRE_GPIO, BOARD_INITPINS_RS485_nRE_PIN, &RS485_nRE_config);

    gpio_pin_config_t Relay_K3_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_8 (pin 2)  */
    GPIO_PinInit(BOARD_INITPINS_Relay_K3_GPIO, BOARD_INITPINS_Relay_K3_PIN, &Relay_K3_config);

    gpio_pin_config_t Relay_K2_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_9 (pin 3)  */
    GPIO_PinInit(BOARD_INITPINS_Relay_K2_GPIO, BOARD_INITPINS_Relay_K2_PIN, &Relay_K2_config);

    gpio_pin_config_t Relay_K6_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_10 (pin 4)  */
    GPIO_PinInit(BOARD_INITPINS_Relay_K6_GPIO, BOARD_INITPINS_Relay_K6_PIN, &Relay_K6_config);

    gpio_pin_config_t Relay_K8_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_11 (pin 5)  */
    GPIO_PinInit(BOARD_INITPINS_Relay_K8_GPIO, BOARD_INITPINS_Relay_K8_PIN, &Relay_K8_config);

    gpio_pin_config_t Relay_K9_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_12 (pin 6)  */
    GPIO_PinInit(BOARD_INITPINS_Relay_K9_GPIO, BOARD_INITPINS_Relay_K9_PIN, &Relay_K9_config);

    gpio_pin_config_t Relay_K1_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_13 (pin 7)  */
    GPIO_PinInit(BOARD_INITPINS_Relay_K1_GPIO, BOARD_INITPINS_Relay_K1_PIN, &Relay_K1_config);

    gpio_pin_config_t INH_DIM_3u4_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO2_2 (pin 16)  */
    GPIO_PinInit(BOARD_INITPINS_INH_DIM_3u4_GPIO, BOARD_INITPINS_INH_DIM_3u4_PIN, &INH_DIM_3u4_config);

    gpio_pin_config_t Relay_K4_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO2_7 (pin 21)  */
    GPIO_PinInit(BOARD_INITPINS_Relay_K4_GPIO, BOARD_INITPINS_Relay_K4_PIN, &Relay_K4_config);

    gpio_pin_config_t INH_DIM_5u6_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO3_8 (pin 42)  */
    GPIO_PinInit(BOARD_INITPINS_INH_DIM_5u6_GPIO, BOARD_INITPINS_INH_DIM_5u6_PIN, &INH_DIM_5u6_config);

    gpio_pin_config_t INH_DIM_1u2_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO3_15 (pin 35)  */
    GPIO_PinInit(BOARD_INITPINS_INH_DIM_1u2_GPIO, BOARD_INITPINS_INH_DIM_1u2_PIN, &INH_DIM_1u2_config);

    gpio_pin_config_t INH_DIM_7u8_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO3_29 (pin 32)  */
    GPIO_PinInit(BOARD_INITPINS_INH_DIM_7u8_GPIO, BOARD_INITPINS_INH_DIM_7u8_PIN, &INH_DIM_7u8_config);

    gpio_pin_config_t Relay_K7_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_30 (pin 31)  */
    GPIO_PinInit(BOARD_INITPINS_Relay_K7_GPIO, BOARD_INITPINS_Relay_K7_PIN, &Relay_K7_config);

